In [1]:
import pandas as pd
df_credit = pd.read_csv('https://www.littledataman.com/samples/credit.csv', parse_dates = ['Approval Date'])
df_cards = pd.read_csv('https://www.littledataman.com/samples/cards.csv', parse_dates = ['Effective Date'])
df_trans = pd.read_csv('https://www.littledataman.com/samples/transactions.csv', parse_dates = ['Date'])

In [7]:
result=pd.merge(df_cards,  df_trans, left_on='Card Number',  right_on='Card Number',
 how='left')
result

,First Name,Last Name,Card Number,Limitation,Effective Date,Date,Transactions,Amount
0,Jacky,White,CN012,10000,2019-09-13 12:00:00,2019-09-01,2,356.20
1,Jacky,White,CN012,10000,2019-09-13 12:00:00,2019-09-02,5,785.00
2,Jacky,White,CN012,10000,2019-09-13 12:00:00,2019-09-03,4,36.90
3,Jane,Nize,CN014,9800,2019-08-16 05:25:00,2019-09-01,3,120.50
4,Jane,Nize,CN014,9800,2019-08-16 05:25:00,2019-09-03,2,23.60
5,Henry,Tone,CN015,12000,2019-09-13 12:00:00,2019-09-01,1,53.23
6,Henry,Tone,CN015,12000,2019-09-13 12:00:00,2019-09-02,2,23.12
7,Desmond,Black,CN016,5000,2019-08-16 05:25:00,2019-09-01,3,25.60
8,Desmond,Black,CN016,5000,2019-08-16 05:25:00,2019-09-02,3,28.30
9,Desmond,Black,CN016,5000,2019-08-16 05:25:00,2019-09-03,4,43.50
10,Henry,Tone,CN015,15000,2020-05-01 12:00:00,2019-09-01,1,53.23
11,Henry,Tone,CN015,15000,2020-05-01 12:00:00,2019-09-02,2,23.12
12,Desmond,Black,CN016,2000,2020-05-01 01:00:00,2019-09-01,3,25.60
13,Desmond,Black,CN016,2000,2020-05-01 01:00:00,2019-09-02,3,28.30
14,Desmond,Black,CN016,2000,2020-05-01 01:00:00,2019-09-03,4,43.50

In [8]:
df_cards_1 = df_cards[:3]
df_trans_1 = df_trans[df_trans['Card Number'].isin (['CN014', 'CN015',
'CN016'])]

In [9]:
df_cards_1

  First Name Last Name Card Number  Limitation      Effective Date
0      Jacky     White       CN012       10000 2019-09-13 12:00:00
1       Jane      Nize       CN014        9800 2019-08-16 05:25:00
2      Henry      Tone       CN015       12000 2019-09-13 12:00:00

In [10]:
df_trans_1

  Card Number       Date  Transactions  Amount
1       CN014 2019-09-01             3  120.50
2       CN015 2019-09-01             1   53.23
3       CN016 2019-09-01             3   25.60
5       CN015 2019-09-02             2   23.12
6       CN016 2019-09-02             3   28.30
8       CN014 2019-09-03             2   23.60
9       CN016 2019-09-03             4   43.50

In [11]:
df_cards_1.merge(df_trans_1 , on = 'Card Number')

,First Name,Last Name,Card Number,Limitation,Effective Date,Date,Transactions,Amount
0,Jane,Nize,CN014,9800,2019-08-16 05:25:00,2019-09-01,3,120.50
1,Jane,Nize,CN014,9800,2019-08-16 05:25:00,2019-09-03,2,23.60
2,Henry,Tone,CN015,12000,2019-09-13 12:00:00,2019-09-01,1,53.23
3,Henry,Tone,CN015,12000,2019-09-13 12:00:00,2019-09-02,2,23.12

In [12]:
df_cards_1.merge(df_trans_1 , on = 'Card Number', how='left')

,First Name,Last Name,Card Number,Limitation,Effective Date,Date,Transactions,Amount
0,Jacky,White,CN012,10000,2019-09-13 12:00:00,NaT,NaN,NaN
1,Jane,Nize,CN014,9800,2019-08-16 05:25:00,2019-09-01,3.0,120.50
2,Jane,Nize,CN014,9800,2019-08-16 05:25:00,2019-09-03,2.0,23.60
3,Henry,Tone,CN015,12000,2019-09-13 12:00:00,2019-09-01,1.0,53.23
4,Henry,Tone,CN015,12000,2019-09-13 12:00:00,2019-09-02,2.0,23.12

In [15]:
df_cards_1.merge(df_trans_1 , left_index = True, right_index = True,
how='left')

,First Name,Last Name,Card Number_x,Limitation,Effective Date,Card Number_y,Date,Transactions,Amount
0,Jacky,White,CN012,10000,2019-09-13 12:00:00,NaN,NaT,NaN,NaN
1,Jane,Nize,CN014,9800,2019-08-16 05:25:00,CN014,2019-09-01,3.0,120.50
2,Henry,Tone,CN015,12000,2019-09-13 12:00:00,CN015,2019-09-01,1.0,53.23